{
  "任务管理": "Task Management",
  "TPSA": "Topological Polar Surface Area",
  "nStereoCenters": "Number of Stereo Centers",
  "Flexibility": "Flexibility: nRot/nRigid",
  "nRigid": "Number of Rigid Bonds",
  "TotalCharge": "TotalCharge",
  "nHet": "Number of Heteroatoms",
  "MaxRing": "Maximum Ring Size",
  "nRing": "Number of Rings",
  "nRot": "Number of Rotatable Bonds",
  "nHD": "Number of Hydrogen Donors",
  "nHA": "Number of Hydrogen Acceptors",
  "MW": "Molecular Weight",
  "名词预测": "Prediction",
  "batchHint1": "A smaller batch size can provide more frequent updates, which is conducive to the model's generalization, but it may result in lower computational efficiency.<br/>A larger batch size can improve computational efficiency, but it may lead to instability in the training process and affect the model's generalization capability.",
  "epochHint": "Increasing the number of epochs can enhance the training of a model, but it also increases the risk of overfitting.",
  "上传数据集": "Upload Dataset",
  "上传文件": "Upload Files",
  "下一步": "Next",
  "下载模板": "Download Template",
  "主动终止": "Terminated",
  "五者hint": "Five-fold cross-validation is a commonly used method for model evaluation. It divides the dataset evenly into five parts, using one part as the test set and the remaining four parts as the training set for each iteration, followed by model training and testing. This method ensures that each data point is used for training and testing once, thereby obtaining more stable and reliable evaluation results. Below are descriptions of different partitioning methods:",
  "任务名称": "Task Name",
  "任务名称:": "Task Name:",
  "任务状态：": "Task Status：",
  "任务用时": "Task Duration",
  "任务类型": "Task Type",
  "任务类型:": "Task Type",
  "使用数据集:": "Prediction Dataset:",
  "使用训练数据集:": "Training Dataset:",
  "使用模型：": "Training Model:",
  "分子相似度": "Molecular Similarity",
  "分层划分hint": "Stratified: Stratified partitioning is a method that ensures the category distribution in each fold of the dataset is consistent with the original dataset. It is particularly applicable to datasets with class imbalance. By ensuring that the proportion of samples from each category in each fold matches that of the overall dataset, it reduces evaluation bias and improves the accuracy of model evaluation,but this partitioning method cannot be applied to regression tasks.",
  "分类": "Classification",
  "分组划分hint": "Group: Group partitioning is based on grouping the dataset according to a key column of categories, ensuring that samples within each group are as evenly distributed as possible across the five folds. This method is suitable for scenarios where it is necessary to maintain consistency of specific attributes, such as ensuring that samples from the same category are represented in both training and testing.",
  "划分方式": "Data Splitting Method",
  "创建时间": "Time Created",
  "删除": "Delete",
  "删除成功": "Deletion Succeeded",
  "卡片": "Card",
  "参数选择": "Select Parameters",
  "否": "No",
  "回归": "Regression",
  "均值": "Mean",
  "备注": "Tags",
  "多标签分类": "Multilabel Classification",
  "多标签回归": "Multilabel Regression",
  "多类别分类": "Multiclass",
  "子结构可解释性": "Substructure interpretability",
  "学习率hint1": "A smaller learning rate can ensure that the model converges stably, but the training process may be slower.<br/>A larger learning rate may lead to rapid convergence of the model, but it can also cause the training process to be unstable or miss the optimal solution.",
  "导出": "Export",
  "导出失败": "Export Failed",
  "导出成功": "Export Successful",
  "当前TARGET": "Current TARGET:",
  "排队中": "Queued",
  "推荐": "Recommended",
  "提交": "Submit",
  "提交任务": "Submit Task",
  "提交成功": "Success",
  "提示": "Hint",
  "操作": "Actions",
  "收藏": "Favorite",
  "数据分布": "Data Distribution",
  "数据分布hint": "Displaying the distribution of data through bars of varying heights facilitates the comparison of numerical sizes across different categories, identification of data patterns and outliers, thereby aiding in the analysis and decision-making process.",
  "数据分析": "Data Analysis",
  "数据分析分类hint": "Using the AUC (Area Under the Curve) to measure the performance of a model allows us to see how the model performs at different thresholds, thereby assessing the model's ability to distinguish between positive and negative classes. The higher the AUC value, the better the model's classification performance. An AUC value of 0.5 indicates that the model's performance is equivalent to random guessing; an AUC value of 1 indicates that the model has perfect classification ability.",
  "数据分析回归hint": "Using a scatter plot to compare actual values with predicted values allows for a visual assessment of the model's predictive accuracy. If the points on the scatter plot are concentrated near a straight line, this indicates that the model's predictions have a small bias; if the points are far from this line, there may be a significant bias. Scatter plots can help identify patterns or trends in the data, as well as reveal outliers or anomalies within the dataset.",
  "数据分析多分类hint": "In multi-class classification tasks, a confusion matrix is a table used to display the relationship between the categories predicted by the model and the actual categories. Each row of the matrix represents an actual category, and each column represents a predicted category. TP: True Positives, which is the number of samples that the model correctly predicted as positive. FP: False positives, which is the number of samples that the model incorrectly predicted as positive when they are actually negative. FN: False negatives, which is the number of samples that the model incorrectly predicted as negative when they are actually positive.",
  "数据总数": "Total Dataset Count",
  "数据集": "Dataset",
  "数据集检查结果：": "check results",
  "新增训练任务": "New Training Task",
  "新增预测任务": "New Prediction Task",
  "方差": "Variance",
  "日志": "Logs",
  "是": "Yes",
  "显示/隐藏 理化性质表格列": "Show/Hide Physical Property Table Columns",
  "停止": "Stop",
  "停止成功": "Stop Successful",
  "更多信息": "More Info",
  "查看模型": "View model",
  "查看模型具体参数": "Model Hyperparameters",
  "查看模型参数": "View model parameters",
  "检查数据集": "Validate Data",
  "模型名称:": "Model name:",
  "模型细节": "Model Details",
  "模型指标": "Model Metrics",
  "模型类型：": "Model Type:",
  "模型选择": "Select Model",
  "模糊搜索任务名称/ID": "Fuzzy Search Task Name / ID / Dataset",
  "正样本数": "Positive Samples",
  "步骤一：选择输入数据": "Step 1: Select Input Data",
  "步骤二：选择训练模型": "Step 2: Select the training model",
  "步骤二：配置训练参数": "Step 2: Configure Training Parameters (Optional)",
  "类别": "Category",
  "经过检查的数据集才可以训练": "Only validated datasets can be used for training",
  "绘制分子": "Draw Molecules",
  "自定义": "Custom",
  "表格": "Table",
  "解释2DGraph": "In the interpretability analysis of 2D images, the red areas indicate that the substructures contribute positively to the predicted properties, while the blue areas indicate a negative influence. The intensity of the color is directly related to the magnitude of the substructure's impact.",
  "解释prob": "In classification tasks, the predicted probability corresponding to a value of 1 indicates the model's confidence level in assigning the sample to the positive class. The closer this value is to 1, the higher the confidence that the model has in classifying the sample as belonging to the positive class. This typically means that, given the features and training data, the model is very confident that the sample should be categorized as positive.",
  "解释std": "In regression tasks, the value referred to is the standard deviation of the predicted values, which reflects the model's uncertainty about the prediction outcomes. When this value is small, it indicates that the model is quite certain about the prediction, meaning that the deviation between the predicted and actual values is small, and the reliability of the prediction is high. Conversely, when this value is large, it signifies that the model has greater uncertainty about the prediction, suggesting a wider range of possible deviations. This can be used to assess the stability and reliability of the model's predictions under different circumstances.",
  "解释多类别std": "In multi-class classification tasks, the model predicts a probability distribution for each sample, with each class having an associated probability value. These probability values are processed through normalization to ensure that their sum equals 1, thus forming a valid probability distribution. The normalized probability distribution can fairly reflect the relative likelihood of each class.",
  "训练": "Training",
  "训练 / 预测": "Training / Prediction",
  "训练日志": "Training Logs",
  "详情": "Details",
  "请上传数据集": "Please upload the dataset",
  "请上传文件": "Please upload file",
  "请输入任务名称": "Please enter the task name",
  "请选择 group_col": "Please select group_col",
  "请选择 smiles 列字段": "Please select the smiles column field",
  "请选择 smiles_col": "Please select smiles_col",
  "请选择 split_method": "Please select split_method",
  "请选择 target 列字段": "Select the target column field",
  "请选择 target_cols": "Please select target_cols",
  "请选择 task": "Please select task",
  "负样本数": "Negative Samples",
  "超参数": "Hyperparameters",
  "超参数优化": "Hyperparameter Optimization",
  "超参数列表": "Hyper-Parameters",
  "输入SMILES": "Input SMILES",
  "运行中": "Running",
  "运行失败": "Failed",
  "运行成功": "Success",
  "运行状态": "Current Status",
  "选择训练模型": "Choose Training Model",
  "选择输入数据": "Choose Input Data",
  "配置训练参数": "Training Settings",
  "随机划分hint": "Random: Random partitioning is achieved by randomly allocating the dataset into five equal parts. This method is simple and straightforward, but due to its randomness, it may lead to an uneven distribution of samples from certain categories in the training and test sets.",
  "预测": "Predict",
  "预测任务": "Prediction Task",
  "预测参数": "Prediction Parameters",
  "骨架hint": "Molecular fingerprint dimensionality reduction scatter plots are a method of simplifying complex molecular data into a two-dimensional view, facilitating our intuitive observation and analysis. In this graph, each point represents a molecule, and the color of the point indicates whether they belong to the validation set or the training set of the current dataset. If points of different colors cluster together, it suggests that these molecules have similarities in structure or properties; if the points are scattered, it indicates significant differences among them. In short, this graph is like a 'map' of molecules, distinguishing different datasets by color, and revealing the similarities and differences between molecules through the distribution and distance of the points.",
  "骨架划分hint": "Scaffold: Scaffold partitioning is a partitioning method specifically designed for datasets with molecular scaffold data. It aims to ensure that samples with the same molecular scaffold are assigned to the same fold as much as possible, maintaining consistency in molecular structure.",
  "文件类型大小tip": "File types supported: CSV/SDF, file size cannot exceed 1GB",
  "超参数列表hint": "Specific hyperparameters used by different models.View the hyperparameters of a model by selecting the specific model in Model Details.",
  "AUC": "Area under the receiver operating characteristic curve, which measures the performance of a classification model at all classification thresholds. The closer the value is to 1, the better the model performs.",
  "AUPRC": "Area under the precision-recall curve, especially suitable for imbalanced datasets.",
  "F1_Score": "F1 score, the harmonic mean of precision and recall, which balances the accuracy and completeness of the model.",
  "ACC": "The proportion of samples correctly classified out of the total number of samples.",
  "MCC": "Matthews correlation coefficient, a value between -1 and +1, used to measure the quality of a binary classification model.",
  "Recall": "The proportion of samples that are actually positive and are correctly predicted as positive.",
  "Precision": "The proportion of samples predicted as positive that are actually positive.",
  "Cohen_kappa": "Measures the consistency between two annotators in a classification task, accounting for chance agreement, and is suitable for situations with uneven class distributions.",
  "Log_Loss": "Logarithmic loss, used to evaluate the performance of classification models. The smaller the value, the better the model performs.",
  "R2": "Coefficient of Determination, which measures the proportion of the variance in the dependent variable that is predictable from the independent variables. A value close to 1 indicates a good model fit.",
  "Spearmanr": "Spearman's rank correlation coefficient, a non-parametric measure of rank correlation, used to measure the monotonic relationship between two variables.",
  "Pearsonr": "Pearson correlation coefficient, used to measure the linear relationship between two continuous variables.",
  "MSE": "Mean Squared Error, which measures the average of the squares of the differences between the actual values and the predicted values. The smaller the value, the better the model performs.",
  "MAE": "Mean Absolute Error, which calculates the average of the absolute values of the differences between the actual values and the predicted values. Similar to MSE, but less sensitive to outliers.",
  "RMSE": "Root Mean Squared Error, the square root of MSE, which is on the same scale as the original data, facilitating interpretation.",
  "Macro_F1": "The Macro F1 score is a method for evaluating the performance of multi-class classification models by averaging the F1 scores of each class, suitable for imbalanced datasets.",
  "Micro_F1": "The Micro F1 score is derived by calculating the total true positives, false positives, and false negatives across all classes to obtain the F1 score, emphasizing the accuracy of predictions for minority classes.",
  "推荐配置": "Recommended Configuration",
  "数据集检查完成": "Data set check complete",
  "请先检查文件": "Please check the file first",
  "五折验证": "Five-fold cross-validation",
  "随机划分（Random）": "Random",
  "骨架划分（Scaffold）": "Scaffold",
  "分组划分（Group）": "Group",
  "分层划分（Stratified）": "Stratified",
  "基础搜索": "Basic Search",
  "扩展搜索": "Extended Search",
  "穷举搜索": "Exhaustive Search",
  "提交成功，进入训练": "Submitted successfully, entering training",
  "数据集检查中，请继续等待": "Data set check in progress, please continue to wait",
  "数据集未通过检查，请检查检查数据列": "The dataset did not pass the check, please check the data columns",
  "检查通过": "Check passed",
  "存在错误数据项": "Error data has been deleted, you can continue creating",
  "检查中": "Checking...",
  "未检查": "Unchecked",
  "检查未能通过": "Check failed",
  "请选择 group 列字段": "Please select the group column field",
  "查看分布图": "View {field} Distribution",
  "分布图": "{field} Distribution",
  "你确定要停止任务": "Are you sure you want to stop the task {id}",
  "确认删除任务": "Are you sure you want to delete the task {id}",
  "模糊搜索SMILES": "Fuzzy Search SMILES / ID",
  "nn_trialsHint": "Maximum number of trials for the NN model",
  "ml_trialsHint": "Maximum number of trials for the ML model",
  "正向": "Positive",
  "负向": "Negative",
  "重新运行": "Re-run",
  "重新运行成功": "Re-run successful",
  "收藏成功": "Successfully favorited",
  "取消收藏成功": "Successfully unfavorited",
  "取消收藏": " Unfavorite",
  "我的收藏": "My Favorites",
  "TaskTypeHint": "Select Auto Detect, and the system will automatically recommend the appropriate task type, which usually does not require user modification.",
  "Uni-Mol (all_h)Hint": "Uni-Mol is a 3D pretrained model that incorporates hydrogen atoms in its molecular representation. It leverages 3D spatial information to enhance predictive accuracy for molecular properties.",
  "Uni-Mol (no_h)Hint": "This variant of Uni-Mol also uses 3D molecular representations but excludes hydrogen atoms from its pretrained model. This can simplify the representation while still capturing essential spatial information.",
  "BERTHint": "BERT (Bidirectional Encoder Representations from Transformers) is an advanced model originally designed for natural language processing. When adapted for molecular property prediction, it typically uses SMILES strings as input to capture sequential patterns in molecular representations.",
  "LRHint": "Logistic Regression is a simple yet effective model for binary classification tasks. ",
  "GBDTHint": "GBDT is an ensemble learning method that builds multiple decision trees sequentially, each trying to correct errors from the previous one. It's highly effective for both regression and classification tasks.",
  "ETHint": "ET (Extremely Randomized Trees) is an ensemble method similar to Random Forests but with more randomness in tree building. This can lead to better generalization and reduced overfitting.",
  "SVMHint": "SVM is a powerful model for classification and regression tasks that works by finding the hyperplane that best separates the data into different classes or predicts continuous values. Kernel functions can be used to handle non-linear relationships.",
  "超参数优化Hint": "Using Bayesian Optimization to tune machine learning model hyperparameters to improve model performance.Hyperparameters are set before the model is trained, as opposed to parameters that are learned during the training process.<br/>Enabling this option will significantly increase the time consumption！",
  "推荐配置Hint": "Three preset search ranges have been set: Basic Search, Basic Search, and Basic Search, with the time consumption increasing in sequence.",
  "Uni-Mol (all_h)": "Uni-Mol-All_H",
  "Uni-Mol (no_h)": "UniMol-No_H",
  "BERT": "BERT-SMILES",
  "LR": "LR (Logistic Regression)",
  "GBDT (梯度提升决策树)": "GBDT (Gradient Boosting Decision Trees)",
  "ET (极端随机树)": "ET (Extremely Randomized Trees)",
  "SVM (支持向量机)": "SVM (Support Vector Machine)",
  "经过检查的数据集才可以预测": "Only validated datasets can be used for prediction",
  "回车换行可添加多个 SMILES 表达式": "Press Enter to add multiple SMILES expressions",
  "训练进度：": "Training Progress:",
  "输入方式": "Input Method",
  "请输入至少一个有效的SMILES表达式": "Please enter at least one valid SMILES expression",
  "请绘制分子": "Please map the molecule",
  "请等待编辑器加载完成": "Please wait for the editor to load",
  "分子指纹 PCA主成分分析绘图": "Molecular Fingerprint PCA Principal Component Analysis Plot",
  "分子指纹 T-SNE降维绘图": "Molecular Fingerprint T-SNE Dimensionality Reduction Plot",
  "模型对比": "Model Comparison",
  "导出预览": "Export Preview",
  "任务名称必须是1到200位的汉字、数字、字母、下划线或横线": "The task name must be 1 to 200 characters long and can only contain Chinese characters, numbers, letters, underscores, or hyphens",
  "请输入 SMILES 表达式": "Please enter SMILES",
  "绘制分子只能输入一个": "Only one molecule can be drawn",
  "请选择输入方式": "Please select the input method",
  "任务提交成功": "Task submitted successfully",
  "用户": "User",
  "可解释性运行中": "Interpretability",
  "预测进度：": "Prediction Progress",
  "FPHint": "A Molecular Fingerprint is a binary encoding of molecular structure that simplifies complex chemical information into a series of numbers. This encoding allows the similarity between molecules to be assessed by calculating the similarity between these numerical strings.",
  "MDHint": "Molecular Descriptors are a set of numerical values that quantify the physicochemical properties and structural features of molecules.",
  "FP": "FP (Molecular Fingerprint)",
  "MD": "MD (Molecular Descriptors)",
  "自动识别": "Auto Detect",
  "可解释性运行状态：": "Interpretability Status:",
  "刷新日志": "Refresh Logs",
  "导出日志": "Export Logs",
  "日志最多hint": "The page supports viewing the latest 10000 lines of logs at most. The more logs you view, the longer the waiting time may be. To view the complete logs, please download and view them.",
  "分类Hint": "Classification tasks are supervised learning tasks that aim to divide input data into two categories. The output of a classification task is a discrete value, usually a label or a category.",
  "回归Hint": "Regression tasks are supervised learning tasks that aim to predict continuous values. The output of a regression task is a continuous value, usually a real number.",
  "开启此选项会大幅增加耗时！": "Open this switch will significantly increase the time!",
  "回归任务不支持分层划分，请修改划分方式": "Regression tasks do not support stratified partitioning, please modify the partitioning method",
  "提交成功,预计扣费": "Submitted successfully, estimated cost ¥{countNumber}",
  "该任务被识别为回归任务，回归任务不支持分层划分，请修改划分方式": "The task has been identified as a regression task, which does not support stratified partitioning. Please modify the partitioning method",
  "分组划分至少需要5个不同的group_col": "Group partitioning requires at least 5 different group_col categories, please modify to meet the requirements of group_col or select other partitioning methods",
  "数据集未通过检查，请输入有效数据集": "The dataset did not pass the check, please enter a valid dataset",
  "target_cols 所选列名不能包含/,请重新选择或者修改数据集 col 名称": "The selected column name for target_cols cannot contain '/', please reselect or modify the dataset column name",
  "请选择 modelPick": "Please select a model",
  "该训练模型未选择 UniMol 无法开启可解释性": "The training model has not selected UniMol and cannot enable interpretability",
  "多分类任务只支持单列 target_cols": "Multiclass tasks only support single column target_cols",
  "多分类": "Multiclass",
  "多分类Hint": "Multiclass classification tasks are supervised learning tasks that aim to divide input data into three or more categories. The output of a multiclass classification task is a discrete value, usually a label or a category.",
  "错误原因可添加微信或点击屏幕右上角我要反馈联系开发者进行排查": "The error reason can be added to WeChat or click the upper right corner of the screen to contact the developer for troubleshooting",
  "消耗光子": " Photon Consumed"
}